HungChienSix/Renesas_SourceCode/Renesas.RA_DFP.6.4.0/SVD/R7FA2T107.svd
                                    <description>Counter clear enabled at the GTCCRA register compare match/ Input capture</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>Counter clear enabled at the GTCCRB register compare match/ Input capture</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>Counter clear enabled at the GTCCRC register compare match</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>Counter clear enabled at the GTCCRD register compare match</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>Counter clear enabled at the GTCCRE register compare match</description>
                                    <value>#101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>110</name>
                                    <description>Counter clear enabled at the GTCCRF register compare match</description>
                                    <value>#110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111</name>
                                    <description>Counter clear enabled at the synchronous counter clearing group</description>
                                    <value>#111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CP1CCE</name>
                            <description>Complementary PWM Mode 1 Crest Source Counter Clear Enable</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Counter clear disabled at the crest of complementary PWM mode 1</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Counter clear enabled at the crest of complementary PWM mode 1</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCLR</name>
                            <description>Software Source Counter Clear Enable</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Counter clear disabled by the GTCLR register</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Counter clear enabled by the GTCLR register</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GTICASR</name>
                    <description>General PWM Timer Input Capture Source Select Register A</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>ASGTRGAR</name>
                            <description>GTETRGA Pin Rising Input Source GTCCRA Input Capture Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTCCRA input capture disabled on the rising edge of GTETRGA input</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTCCRA input capture enabled on the rising edge of GTETRGA input</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASGTRGAF</name>
                            <description>GTETRGA Pin Falling Input Source GTCCRA Input Capture Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTCCRA input capture disabled on the falling edge of GTETRGA input</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTCCRA input capture enabled on the falling edge of GTETRGA input</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASGTRGBR</name>
                            <description>GTETRGB Pin Rising Input Source GTCCRA Input Capture Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTCCRA input capture disabled on the rising edge of GTETRGB input</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTCCRA input capture enabled on the rising edge of GTETRGB input</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASGTRGBF</name>
                            <description>GTETRGB Pin Falling Input Source GTCCRA Input Capture Enable</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTCCRA input capture disabled on the falling edge of GTETRGB input</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTCCRA input capture enabled on the falling edge of GTETRGB input</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASCARBL</name>
                            <description>GTIOCnA Pin Rising Input during GTIOCnB Value Low Source GTCCRA Input Capture Enable</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTCCRA input capture disabled on the rising edge of GTIOCnA input when GTIOCnB input is 0</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTCCRA input capture enabled on the rising edge of GTIOCnA input when GTIOCnB input is 0</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASCARBH</name>
                            <description>GTIOCnA Pin Rising Input during GTIOCnB Value High Source GTCCRA Input Capture Enable</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTCCRA input capture disabled on the rising edge of GTIOCnA input when GTIOCnB input is 1</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTCCRA input capture enabled on the rising edge of GTIOCnA input when GTIOCnB input is 1</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASCAFBL</name>
                            <description>GTIOCnA Pin Falling Input during GTIOCnB Value Low Source GTCCRA Input Capture Enable</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTCCRA input capture disabled on the falling edge of GTIOCnA input when GTIOCnB input is 0</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTCCRA input capture enabled on the falling edge of GTIOCnA input when GTIOCnB input is 0</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASCAFBH</name>
                            <description>GTIOCnA Pin Falling Input during GTIOCnB Value High Source GTCCRA Input Capture Enable</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTCCRA input capture disabled on the falling edge of GTIOCnA input when GTIOCnB input is 1</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTCCRA input capture enabled on the falling edge of GTIOCnA input when GTIOCnB input is 1</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASCBRAL</name>
                            <description>GTIOCnB Pin Rising Input during GTIOCnA Value Low Source GTCCRA Input Capture Enable</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTCCRA input capture disabled on the rising edge of GTIOCnB input when GTIOCnA input is 0</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTCCRA input capture enabled on the rising edge of GTIOCnB input when GTIOCnA input is 0</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASCBRAH</name>
                            <description>GTIOCnB Pin Rising Input during GTIOCnA Value High Source GTCCRA Input Capture Enable</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTCCRA input capture disabled on the rising edge of GTIOCnB input when GTIOCnA input is 1</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTCCRA input capture enabled on the rising edge of GTIOCnB input when GTIOCnA input is 1</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASCBFAL</name>
                            <description>GTIOCnB Pin Falling Input during GTIOCnA Value Low Source GTCCRA Input Capture Enable</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTCCRA input capture disabled on the falling edge of GTIOCnB input when GTIOCnA input is 0</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTCCRA input capture enabled on the falling edge of GTIOCnB input when GTIOCnA input is 0</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASCBFAH</name>
                            <description>GTIOCnB Pin Falling Input during GTIOCnA Value High Source GTCCRA Input Capture Enable</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTCCRA input capture disabled on the falling edge of GTIOCnB input when GTIOCnA input is 1</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTCCRA input capture enabled on the falling edge of GTIOCnB input when GTIOCnA input is 1</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASELCA</name>
                            <description>ELC_GPTA Event Source GTCCRA Input Capture Enable</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTCCRA input capture disabled at the ELC_GPTA input</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTCCRA input capture enabled at the ELC_GPTA input</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASELCB</name>
                            <description>ELC_GPTB Event Source GTCCRA Input Capture Enable</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTCCRA input capture disabled at the ELC_GPTB input</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTCCRA input capture enabled at the ELC_GPTB input</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASELCC</name>
                            <description>ELC_GPTC Event Source GTCCRA Input Capture Enable</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTCCRA input capture disabled at the ELC_GPTC input</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTCCRA input capture enabled at the ELC_GPTC input</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASELCD</name>
                            <description>ELC_GPTD Event Source GTCCRA Input Capture Enable</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTCCRA input capture disabled at the ELC_GPTD input</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTCCRA input capture enabled at the ELC_GPTD input</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASELCE</name>
                            <description>ELC_GPTE Event Source GTCCRA Input Capture Enable</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                            <enumeratedValues>
